In [1]:
// 𝗗𝗮𝘁𝗮 𝗘𝗻𝗴𝗶𝗻𝗲𝗲𝗿 𝗜𝗻𝘁𝗲𝗿𝘃𝗶𝗲𝘄 𝗤𝘂𝗲𝘀𝘁𝗶𝗼𝗻 🚀

// This SQL question was asked in a Product company interview (Easy - Medium level).

// ❓ Write a query for below data so that each two rows are merged.
// Input -
// ID Name
// 1 Person1
// 2 Person2
// 3 Person3
// 4 Person4
// 5 Person5
// 6 Person6
// 7 Person7
// 8 Person8
// 9 Person9
// 10 Person10

// Output-
// RESULT
// 1 Person1, 2 Person2
// 3 Person3, 4 Person4
// 5 Person5, 6 Person6
// 7 Person7, 8 Person8
// 9 Person9, 10 Person10


val people=Seq(
    (1,"Person1"),
    (2,"Person2"),
    (3,"Person3"),
    (4,"Person4"),
    (5,"Person5"),
    (6,"Person6"),
    (7,"Person7"),
    (8,"Person8"),
    (9,"Person9"),
    (10,"Person10")
).toDF("id", "name")

people.show(false)

Intitializing Scala interpreter ...

Spark Web UI available at http://192.168.0.104:4040
SparkContext available as 'sc' (version = 3.4.1, master = local[*], app id = local-1705935795681)
SparkSession available as 'spark'

+---+--------+
|id |name    |
+---+--------+
|1  |Person1 |
|2  |Person2 |
|3  |Person3 |
|4  |Person4 |
|5  |Person5 |
|6  |Person6 |
|7  |Person7 |
|8  |Person8 |
|9  |Person9 |
|10 |Person10|
+---+--------+

people: org.apache.spark.sql.DataFrame = [id: int, name: string]

In [3]:
people.createOrReplaceTempView("people_tbl")

spark.sql("""
  SELECT 
      CONCAT(t1.id,' ',t1.name, ',',t2.id, t2.name) as result
  FROM people_tbl t1 INNER JOIN people_tbl t2
  ON (t1.id+1)=t2.id
  WHERE t1.id%2==1
""").show(false)

+--------------------+
|result              |
+--------------------+
|1 Person1,2Person2  |
|3 Person3,4Person4  |
|5 Person5,6Person6  |
|7 Person7,8Person8  |
|9 Person9,10Person10|
+--------------------+

In [5]:
spark.sql("""
WITH CTE AS (
  SELECT
      id,
      name,
      NTILE(5) OVER(order by id) nt
  FROM people_tbl
)
SELECT 
    CONCAT_WS(',', COLLECT_LIST(CONCAT(id, ' ',name))) as result
FROM CTE
GROUP BY nt
ORDER BY nt
""").show(false)

+---------------------+
|result               |
+---------------------+
|1 Person1,2 Person2  |
|3 Person3,4 Person4  |
|5 Person5,6 Person6  |
|7 Person7,8 Person8  |
|9 Person9,10 Person10|
+---------------------+